---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.NonMonotoneRoof
source: html/a3fa2c13-f4db-dc34-e763-8b0cdb85dd4e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.NonMonotoneRoof Property

All parts of an extruded roof must face upward. Make sure that no part of the sketch lies below any other part of the sketch.

## Syntax (C#)
```csharp
public static FailureDefinitionId NonMonotoneRoof { get; }
```